ctapang/v0_70b/framework/peripheral/usb/processor/usb_p32mx170f256c.h
INLINE SFR_TYPE* _USB_EP12_STALL_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP12;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

INLINE SFR_TYPE* _USB_EP12_HANDSHAKE_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP12;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

INLINE SFR_TYPE* _USB_EP13_CONTROL_OFF_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP13;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

INLINE SFR_TYPE* _USB_EP13_RCV_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP13;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

INLINE SFR_TYPE* _USB_EP13_XMIT_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP13;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

INLINE SFR_TYPE* _USB_EP13_STALL_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP13;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

INLINE SFR_TYPE* _USB_EP13_HANDSHAKE_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP13;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

INLINE SFR_TYPE* _USB_EP14_CONTROL_OFF_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP14;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

INLINE SFR_TYPE* _USB_EP14_RCV_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP14;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

INLINE SFR_TYPE* _USB_EP14_XMIT_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP14;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

INLINE SFR_TYPE* _USB_EP14_STALL_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP14;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

INLINE SFR_TYPE* _USB_EP14_HANDSHAKE_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP14;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

INLINE SFR_TYPE* _USB_EP15_CONTROL_OFF_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP15;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

INLINE SFR_TYPE* _USB_EP15_RCV_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP15;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

INLINE SFR_TYPE* _USB_EP15_XMIT_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP15;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

INLINE SFR_TYPE* _USB_EP15_STALL_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP15;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

INLINE SFR_TYPE* _USB_EP15_HANDSHAKE_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP15;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

INLINE SFR_DATA _USB_UnOTGIR_VAL_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGIR_IDIF_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_UnOTGIE_VAL_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGIE_IDIE_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_ID_STATE_CHANGE_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGSTAT_ID_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_LINE_STATE_STABLE_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGSTAT_LSTATE_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_SESSION_VALID_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGSTAT_SESVD_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_B_SESSION_END_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGSTAT_SESEND_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_A_SESSION_VALID_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGSTAT_VBUSVD_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_DPLUS_PULLUP_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGCON_DPPULUP_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_DMINUS_PULLUP_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGCON_DMPULUP_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

INLINE SFR_DATA _USB_DPLUS_PULLDN_ON_MASK(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGCON_DPPULDWN_MASK;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

