ctapang/v0_70b/framework/peripheral/usb/processor/usb_p32mx170f256c.h
INLINE_API bool PLIB_USB_ExistsGEN_InterruptStatus(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsGEN_InterruptStatus_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_InterruptEnable(USB_MODULE_ID index, USB_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_InterruptEnable_Default(index, interruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_InterruptDisable(USB_MODULE_ID index, USB_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_InterruptDisable_Default(index, interruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_InterruptIsEnabled(USB_MODULE_ID index, USB_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            return USB_InterruptIsEnabled_Default(index, interruptFlag);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool PLIB_USB_ExistsGEN_Interrupt(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsGEN_Interrupt_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_AllInterruptEnable(USB_MODULE_ID index, USB_INTERRUPTS usbInterruptsFlag, USB_ERROR_INTERRUPTS usbErrorInterruptsFlag, USB_OTG_INTERRUPTS otgInterruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_AllInterruptEnable_Default(index, usbInterruptsFlag, usbErrorInterruptsFlag, otgInterruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API USB_INTERRUPTS PLIB_USB_InterruptEnableGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_InterruptEnableGet_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (USB_INTERRUPTS)0;
    }
}

INLINE_API bool PLIB_USB_ExistsALL_Interrupt(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsALL_Interrupt_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_ErrorInterruptFlagSet(USB_MODULE_ID index, USB_ERROR_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_ErrorInterruptFlagSet_Default(index, interruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_ErrorInterruptFlagClear(USB_MODULE_ID index, USB_ERROR_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_ErrorInterruptFlagClear_Default(index, interruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_ErrorInterruptFlagGet(USB_MODULE_ID index, USB_ERROR_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ErrorInterruptFlagGet_Default(index, interruptFlag);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API USB_ERROR_INTERRUPTS PLIB_USB_ErrorInterruptFlagAllGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ErrorInterruptFlagAllGet_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (USB_ERROR_INTERRUPTS)0;
    }
}

INLINE_API bool PLIB_USB_ExistsERR_InterruptStatus(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsERR_InterruptStatus_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_ErrorInterruptEnable(USB_MODULE_ID index, USB_ERROR_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_ErrorInterruptEnable_Default(index, interruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_ErrorInterruptDisable(USB_MODULE_ID index, USB_ERROR_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_ErrorInterruptDisable_Default(index, interruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_ErrorInterruptIsEnabled(USB_MODULE_ID index, USB_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ErrorInterruptIsEnabled_Default(index, interruptFlag);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool PLIB_USB_ExistsERR_Interrupt(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsERR_Interrupt_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API uint8_t PLIB_USB_LastTransactionEndPtGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_LastTransactionEndPtGet_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

INLINE_API bool PLIB_USB_ExistsLastEndpoint(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsLastEndpoint_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API USB_BUFFER_DIRECTION PLIB_USB_LastTransactionDirectionGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_LastTransactionDirectionGet_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (USB_BUFFER_DIRECTION)0;
    }
}

INLINE_API bool PLIB_USB_ExistsLastDirection(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsLastDirection_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API USB_PING_PONG_STATE PLIB_USB_LastTransactionPingPongStateGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_LastTransactionPingPongStateGet_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (USB_PING_PONG_STATE)0;
    }
}

INLINE_API bool PLIB_USB_ExistsLastPingPong(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsLastPingPong_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_LastTransactionDetailsGet(USB_MODULE_ID index, USB_BUFFER_DIRECTION* direction, USB_PING_PONG_STATE* pingpong, uint8_t* endpoint)
{
    switch (index) {
        case USB_ID_1 :
            USB_LastTransactionDetailsGet_Default(index, direction, pingpong, endpoint);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

