ctapang/v0_70b/framework/peripheral/usb/processor/usb_p32mx170f256c.h
INLINE_API bool PLIB_USB_ExistsStartOfFrames(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsStartOfFrames_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_TokenSpeedSelect(USB_MODULE_ID index, USB_TOKEN_SPEED tokenSpeed)
{
    switch (index) {
        case USB_ID_1 :
            USB_TokenSpeedSelect_Default(index, tokenSpeed);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_ExistsNextTokenSpeed(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsNextTokenSpeed_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_DeviceAddressSet(USB_MODULE_ID index, uint8_t address)
{
    switch (index) {
        case USB_ID_1 :
            USB_DeviceAddressSet_Default(index, address);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API uint8_t PLIB_USB_DeviceAddressGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_DeviceAddressGet_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

INLINE_API bool PLIB_USB_ExistsDeviceAddress(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsDeviceAddress_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API uint16_t PLIB_USB_FrameNumberGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_FrameNumberGet_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

INLINE_API bool PLIB_USB_ExistsFrameNumber(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsFrameNumber_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API USB_PID PLIB_USB_TokenPIDGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_TokenPIDGet_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (USB_PID)0;
    }
}

INLINE_API void PLIB_USB_TokenPIDSet(USB_MODULE_ID index, USB_PID pidValue)
{
    switch (index) {
        case USB_ID_1 :
            USB_TokenPIDSet_Default(index, pidValue);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_TokenSend(USB_MODULE_ID index, USB_PID pidValue, uint8_t endpoint, uint8_t deviceAddress, bool isLowSpeed)
{
    switch (index) {
        case USB_ID_1 :
            USB_TokenSend_Default(index, pidValue, endpoint, deviceAddress, isLowSpeed);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_ExistsTokenPID(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsTokenPID_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API uint8_t PLIB_USB_TokenEPGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_TokenEPGet_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

INLINE_API void PLIB_USB_TokenEPSet(USB_MODULE_ID index, uint8_t epValue)
{
    switch (index) {
        case USB_ID_1 :
            USB_TokenEPSet_Default(index, epValue);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_ExistsTokenEP(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsTokenEP_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API uint8_t PLIB_USB_SOFThresholdGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_SOFThresholdGet_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

INLINE_API void PLIB_USB_SOFThresholdSet(USB_MODULE_ID index, uint8_t threshold)
{
    switch (index) {
        case USB_ID_1 :
            USB_SOFThresholdSet_Default(index, threshold);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_ExistsSOFThreshold(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsSOFThreshold_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void* PLIB_USB_BDTBaseAddressGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_BDTBaseAddressGet_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (void*)0;
    }
}

INLINE_API void PLIB_USB_BDTBaseAddressSet(USB_MODULE_ID index, void* address)
{
    switch (index) {
        case USB_ID_1 :
            USB_BDTBaseAddressSet_Default(index, address);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_ExistsBDTBaseAddress(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsBDTBaseAddress_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_EyePatternDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_EyePatternDisable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_EyePatternEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_EyePatternEnable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_ExistsEyePattern(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsEyePattern_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

