ctapang/v0_70b/framework/peripheral/usb/processor/usb_p32mx170f256c.h
INLINE_API bool PLIB_USB_ExistsEP0NAKRetry(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsEP0NAKRetry_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_EPnTxSelect(USB_MODULE_ID index, uint8_t epValue, USB_EP_TXRX epTxRx)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnTxSelect_Default(index, epValue, epTxRx);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_EPnRxSelect(USB_MODULE_ID index, uint8_t epValue, USB_EP_TXRX epTxRx)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnRxSelect_Default(index, epValue, epTxRx);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_EPnTxRxSelect(USB_MODULE_ID index, uint8_t epValue, USB_EP_TXRX epTxRx)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnTxRxSelect_Default(index, epValue, epTxRx);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_ExistsEPnTxRx(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsEPnTxRx_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_EPnRxEnable(USB_MODULE_ID index, uint8_t endpoint)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnRxEnable_PIC32(index, endpoint);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_EPnRxDisable(USB_MODULE_ID index, uint8_t endpoint)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnRxDisable_PIC32(index, endpoint);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_EPnTxEnable(USB_MODULE_ID index, uint8_t endpoint)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnTxEnable_PIC32(index, endpoint);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_EPnTxDisable(USB_MODULE_ID index, uint8_t endpoint)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnTxDisable_PIC32(index, endpoint);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_EPnHandshakeEnable(USB_MODULE_ID index, uint8_t epValue)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnHandshakeEnable_PIC32(index, epValue);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_EPnHandshakeDisable(USB_MODULE_ID index, uint8_t epValue)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnHandshakeDisable_PIC32(index, epValue);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_EPnControlTransferEnable(USB_MODULE_ID index, uint8_t epValue)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnControlTransferEnable_PIC32(index, epValue);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_EPnControlTransferDisable(USB_MODULE_ID index, uint8_t epValue)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnControlTransferDisable_PIC32(index, epValue);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_EPnAttributesSet(USB_MODULE_ID index, uint8_t epValue, int direction, bool isControl, bool handshake)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnAttributesSet_PIC32(index, epValue, direction, isControl, handshake);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_EPnDirectionDisable(USB_MODULE_ID index, uint8_t epValue, int direction)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnDirectionDisable_PIC32(index, epValue, direction);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_EPnAttributesClear(USB_MODULE_ID index, uint8_t epValue)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnAttributesClear_PIC32(index, epValue);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_EPnIsStalled(USB_MODULE_ID index, uint8_t epValue)
{
    switch (index) {
        case USB_ID_1 :
            return USB_EPnIsStalled_PIC32(index, epValue);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void PLIB_USB_EPnStallClear(USB_MODULE_ID index, uint8_t epValue)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnStallClear_PIC32(index, epValue);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void PLIB_USB_EP0HostSetup(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_EP0HostSetup_PIC32(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool PLIB_USB_ExistsEPnRxEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsEPnRxEnable_PIC32(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void* PLIB_USB_BufferAddressGet(USB_MODULE_ID index, void* pBDT, USB_PING_PONG_MODE ppMode, uint8_t epValue, USB_BUFFER_DIRECTION bufferDirection, USB_BUFFER_PING_PONG bufferPingPong)
{
    switch (index) {
        case USB_ID_1 :
            return USB_BufferAddressGet_PIC32(index, pBDT, ppMode, epValue, bufferDirection, bufferPingPong);
        case USB_NUMBER_OF_MODULES :
        default :
            return (void*)0;
    }
}

